/*
 * server_errordef.h
 *
 *  Created on: 2011-12-2
 *      Author: jimm
 */

#ifndef SERVER_ERRORDEF_H_
#define SERVER_ERRORDEF_H_

/***************************************************************************************************
* 错误标识：	E_HS_CHANNELISFULL
*
* 错误描述：	玩家对象创建失败
*/
#define E_HS_CHANNELISFULL										0x80040001

/***************************************************************************************************
* 错误标识：	E_HS_ADDREGIONISFULL
*
* 错误描述：	分区管理器已满
*/
#define E_HS_ADDREGIONISFULL									0x80040002

/***************************************************************************************************
* 错误标识：	E_HS_ADDREGIONISEXIST
*
* 错误描述：	分区已经存在
*/
#define E_HS_ADDREGIONISEXIST									0x80040003

/***************************************************************************************************
* 错误标识：	E_HS_CREATEPLAYERMGTERROR
*
* 错误描述：	创建玩家管理器错误
*/
#define E_HS_CREATEPLAYERMGTERROR								0x80040004

/***************************************************************************************************
* 错误标识：	E_HS_CREATEREGIONMGTERROR
*
* 错误描述：	创建分区管理器错误
*/
#define E_HS_CREATEREGIONMGTERROR								0x80040005

/***************************************************************************************************
* 错误标识：	E_HS_CREATEROOMMGTERROR
*
* 错误描述：	创建房间管理器错误
*/
#define E_HS_CREATEROOMMGTERROR									0x80040006

/***************************************************************************************************
* 错误标识：	E_HS_CREATEIPMAPMGTERROR
*
* 错误描述：	创建IP映射管理器错误
*/
#define E_HS_CREATEIPMAPMGTERROR								0x80040007

/***************************************************************************************************
* 错误标识：	E_HS_PLAYRENOTINROOM
*
* 错误描述：	玩家不在房间中
*/
#define E_HS_PLAYRENOTINROOM									0x80020017

/***************************************************************************************************
* 错误标识：	E_HS_SECHOSTISFULL
*
* 错误描述：副室主已经满了不能添加
*/
#define E_HS_SECHOSTISFULL										0x80020028
/***************************************************************************************************
* 错误标识：	E_HS_ADMISFULL
*
* 错误描述：管理员已经满了不能添加
*/
#define E_HS_ADMISFULL										    0x80020029
/***************************************************************************************************
* 错误标识：	E_HS_TEMPADMISFULL
*
* 错误描述：临时管理员已经满了不能添加
*/
#define E_HS_TEMPADMISFULL										0x80020030

/***************************************************************************************************
* 错误标识：	E_HS_NOPERMISSIONS
*
* 错误描述：没有权限
*/
#define E_HS_NOPERMISSIONS     									0x8002001e

/***************************************************************************************************
* 错误标识：	E_HS_NOTEXISTROLERANK
*
* 错误描述：系统不存在的权限
*/
#define E_HS_NOTEXISTROLERANK     								0x8002001f

/***************************************************************************************************
* 错误标识：	E_HS_ADMINOUTOFBOUND
*
* 错误描述：权限数组越界
*/
#define E_HS_ADMINOUTOFBOUND									0x80080001

/***************************************************************************************************
* 错误标识：	E_HS_ISOTHERROOMADMIN
*
* 错误描述：已经是管理员
*/
#define E_HS_ISOTHERROOMADMIN									0x80080002

#endif /* SERVER_ERRORDEF_H_ */
